"CIAdditionCompositing" = "Adição";
"CIAffineClamp" = "Grampo Affine";
"CIAffineTile" = "Mosaico Affine";
"CIAffineTransform" = "Transformação Affine";
"CIBarsSwipeTransition"="Transição de passagem de barras";
"CIBlendWithMask" = "Misturar com máscara";
"CIBloom" = "Brilho";
"CIBoxBlur"="Desfocagem de caixa";
"CIBumpDistortion" = "Distorção de alto";
"CIBumpDistortionLinear"="Distorção de alto linear";
"CICMYKHalftone" = "Meio-tom CMYK";
"CICheckerboardGenerator" = "Tabuleiro de xadrez";
"CICircleSplashDistortion" = "Distorção de salpico de círculo";
"CICircularScreen" = "Ecrã circular";
"CICircularWrap" = "Distorção de molde circular";
"CIColorControls" = "Controlos de cores";
"CIColorCube" = "Cubo colorido";
"CIColorInvert" = "Inversão de cores";
"CIColorMap" = "Mapa de cores";
"CIColorMatrix" = "Matriz de cores";
"CIColorMonochrome" = "Cor monocromática";
"CIColorPosterize" = "Posterização de cores";
"CIComicEffect" = "Efeito de banda desenhada";
"CIConstantColorGenerator" = "Cor constante";
"CICopyMachineTransition" = "Fotocopiadora";
"CICrop" = "Recortar";
"CICrystallize" = "Cristalizar";
"CIDiscBlur"="Desfocagem de disco";
"CIDisintegrateWithMaskTransition" = "Desintegrar com máscara";
"CIDisplacementDistortion" = "Distorção de deslocamento";
"CIDissolveTransition" = "Dissolver";
"CIDotScreen" = "Ecrã de pontos";
"CIEdges" = "Contornos";
"CIEdgeWork" = "Trabalho de contornos";
"CIEightfoldReflectedTile"="Mosaico reflectido oito vezes";
"CIExposureAdjust" = "Ajuste da exposição";
"CIFalseColor" = "Cor falsa";
"CIFastBoxBlur" = "Desfocagem rápida de caixa";
"CIFastDiscBlur" = "Desfocagem rápida de disco";
"CIFlashTransition" = "Flash";
"CIFourfoldReflectedTile"="Mosaico reflectido quatro vezes";
"CIFourfoldRotatedTile"="Mosaico rodado quatro vezes";
"CIFourfoldTranslatedTile"="Mosaico traduzido quatro vezes";
"CIGammaAdjust" = "Regulação de gama";
"CIGaussianBlur" = "Desfocagem gaussiana";
"CIGaussianGradient" = "Gradação gaussiana";
"CIGlassDistortion" = "Distorção do vidro";
"CIGlassLozenge" = "Losango de vidro";
"CIGlideReflectedTile"="Deslizamento do mosaico reflectido";
"CIGloom" = "Sombra";
"CIHatchedScreen" = "Ecrã tracejado";
"CIHeightFieldFromMask" = "Campo de altura a partir da máscara";
"CIHexagonalPixellate"="Pixelização hexagonal";
"CIHoleDistortion" = "Distorção de orifício";
"CIHueAdjust" = "Ajuste de tonalidade";
"CIKaleidoscope" = "Caleidoscópio";
"CILanczosScaleTransform" = "Transformação da escala Lanczos";
"CILenticularHaloGenerator" = "Auréola lenticular";
"CILineOverlay" = "Sobreposição de linhas";
"CILineScreen" = "Ecrã de linhas";
"CILinearGradient" = "Gradação linear";
"CIMaskToAlpha" = "Mascarar para alfa";
"CIMaximumCompositing" = "Máxima";
"CIMedianFilter" = "Mediano";
"CIMinimumCompositing" = "Mínima";
"CIModTransition" = "Mod";
"CIMotionBlur" = "Desfocagem de movimento";
"CIMultiplyCompositing" = "Multiplicar";
"CINoiseReduction" = "Redução de ruído";
"CIOpTile" = "Mosaico op";
"CIPageCurlTransition" = "Ondulação da página";
"CIParallelogramTile" = "Mosaico paralelogramo";
"CIPerspectiveTile" = "Mosaico em perspectiva";
"CIPerspectiveTransform" = "Transformação da perspectiva";
"CIPinchDistortion" = "Distorção de aperto";
"CIPixellate" = "Pixelizar";
"CIPointillize" = "Pontilhar";
"CIRadialGradient" = "Gradação radial";
"CIRandomGenerator" = "Gerador aleatório";
"CIRippleTransition" = "Ondulação";
"CISepiaTone" = "Sépia";
"CIShadedMaterial" = "Material sombreado";
"CISharpenLuminance" = "Luminosidade nítida";
"CISixfoldReflectedTile"="Mosaico reflectido seis vezes";
"CISixfoldRotatedTile"="Mosaico rodado seis vezes";
"CISourceAtopCompositing" = "Origem em cima";
"CISourceInCompositing" = "Entrada de origem";
"CISourceOutCompositing" = "Saída de origem";
"CISourceOverCompositing" = "Origem por cima";
"CISpotColor" = "Cor básica";
"CISpotLight" = "Luz básica";
"CIStarShineGenerator" = "Brilho de estrelas";
"CIStripesGenerator" = "Tiras";
"CISunbeamsGenerator" = "Raios de sol";
"CISwipeTransition" = "Passagem";
"CITorusLensDistortion" = "Distorção de lente de toro";
"CITriangleTile" = "Mosaico triangular";
"CITwelvefoldReflectedTile"="Mosaico reflectido doze vezes";
"CITwirlDistortion" = "Distorção de pirueta";
"CIUnsharpMask" = "Desfocar máscara";
"CIVortexDistortion" = "Distorção de vórtice";
"CIWhitePointAdjust" = "Ajuste do ponto branco";
"CIZoomBlur" = "Desfocagem de zoom";
"CIColorBlendMode" = "Modo de mistura de cores";
"CIColorBurnBlendMode" = "Modo de mistura de cores queimadas";
"CIColorDodgeBlendMode" = "Modo de mistura de cores iludidas";
"CIDarkenBlendMode" = "Modo de mistura de escurecer";
"CIDifferenceBlendMode" = "Modo de mistura diferente";
"CIExclusionBlendMode" = "Modo de mistura de exclusão";
"CIHardLightBlendMode" = "Modo de mistura de luz de alto contraste";
"CIHueBlendMode" = "Modo de mistura de tonalidades";
"CILightenBlendMode" = "Modo de mistura de aclarar";
"CILuminosityBlendMode" = "Modo de mistura de luminosidades";
"CIMultiplyBlendMode" = "Modo de mistura de multiplicação";
"CIOverlayBlendMode" = "Modo de mistura de sobreposições";
"CISaturationBlendMode" = "Modo de mistura de saturação";
"CIScreenBlendMode" = "Modo de mistura de ecrãs";
"CISoftLightBlendMode" = "Modo de mistura de luz suave";
"CIAreaHistogram" = "Histograma da área";
"CIAreaMaximum" = "Máximo da área";
"CIAreaMinimum" = "Mínimo da área";
"CIAreaMaximumAlpha" = "Alfa máximo da área";
"CIAreaMinimumAlpha" = "Alfa mínimo da área";
"CIAreaAverage" = "Média da área";
"CIRowAverage" = "Média da linha";
"CIColumnAverage" = "Média da coluna";
"CIMinimumComponent" = "Componente mínimo";
"CIMaximumComponent" = "Componente máximo";
